# Cast & Crew Selection Exploratory Data Analysis (EDA)

In [73]:
import pandas as pd

In [74]:
castCrewSelections = pd.read_pickle('v1_castCrewSelections.pkl')
display(castCrewSelections.shape)
castCrewSelections.head()

(33298, 23)

,tconst,ordering,nconst,category,job,characters,primaryName,birthYear,deathYear,primaryProfession,...,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,titleId,averageRating,numVotes
0,tt0026174,2,nm0000014,actress,\N,"[""Arabella Bishop""]",Olivia de Havilland,1916,\N,"actress,soundtrack",...,Captain Blood,Captain Blood,0,1935,\N,119,"Action,Adventure",tt0026174,7.8,11188
1,tt0029843,2,nm0000014,actress,\N,"[""Maid Marian""]",Olivia de Havilland,1916,\N,"actress,soundtrack",...,The Adventures of Robin Hood,The Adventures of Robin Hood,0,1938,\N,102,"Action,Adventure,Romance",tt0029843,8.0,42316
2,tt0034277,2,nm0000014,actress,\N,"[""Elizabeth Bacon""]",Olivia de Havilland,1916,\N,"actress,soundtrack",...,They Died with Their Boots On,They Died with Their Boots On,0,1941,\N,140,"Biography,Drama,Romance",tt0034277,7.3,5062
3,tt0040806,1,nm0000014,actress,\N,"[""Virginia Stuart Cunningham""]",Olivia de Havilland,1916,\N,"actress,soundtrack",...,The Snake Pit,The Snake Pit,0,1948,\N,108,"Drama,Mystery",tt0040806,7.6,5696
4,tt0041452,1,nm0000014,actress,\N,"[""Catherine Sloper""]",Olivia de Havilland,1916,\N,"actress,soundtrack",...,The Heiress,The Heiress,0,1949,\N,115,"Drama,Romance",tt0041452,8.2,11194

In [75]:
#movieSelections = pd.read_pickle('v1_movieSelections5kVotes.pkl')
#movieSelections.shape

In [76]:
#castCrewSelections = castCrewSelectionsIn.merge(movieSelections, left_on='tconst', right_on='tconst', how='inner')

# display column & row information
#display(castCrewSelections.shape)

# display top 5 rows
#castCrewSelections.head()

In [77]:
actorSelections = castCrewSelections[castCrewSelections.category == 'actor']
actorSelections.shape

(15009, 23)

In [78]:
actorSelectionsAgg = (actorSelections.groupby('primaryName')
   .agg({'tconst':'count', 'numVotes': 'sum'})
   .reset_index()
   .rename(columns={'Movies Titles':'Average Rating'})
   )
actorSelectionsAgg.shape

(4273, 3)

In [79]:
actorSelectionsAgg.head()

           primaryName  tconst  numVotes
0  'Weird Al' Yankovic       1     23040
1              50 Cent       7    402132
2   A. Michael Baldwin       3     39159
3             AJ Bowen       3     97993
4           Aamir Khan       5    208649

In [80]:
actorSelectionsAgg = actorSelectionsAgg[actorSelectionsAgg.tconst >= 30]
actorSelectionsAgg.shape

(57, 3)

In [81]:
actorSelectionsAgg.sort_values('numVotes', ascending=False, inplace=True)

# Top 10 Actors Ranked by Highest Movie Rating With 10 or More Films

In [82]:
actorSelectionsAgg.head(10)

            primaryName  tconst  numVotes
431           Brad Pitt      34  11683749
3944          Tom Hanks      45  10997355
505        Bruce Willis      59   9663774
3361     Robert De Niro      67   8928248
2633         Matt Damon      39   8835679
3524  Samuel L. Jackson      57   8424287
2903     Morgan Freeman      44   8195573
3363  Robert Downey Jr.      38   8066216
1485      Harrison Ford      36   7838569
3938         Tom Cruise      36   7791741

In [83]:
actressSelections = castCrewSelections[castCrewSelections.category == 'actress']
actressSelections.shape

(9155, 23)

In [84]:
actressSelectionsAgg = (actressSelections.groupby('primaryName')
   .agg({'tconst':'count', 'numVotes': 'sum'})
   .reset_index()
   .rename(columns={'Movies Titles':'Average Rating'})
   )
actressSelectionsAgg.shape

(3124, 3)

In [85]:
actressSelectionsAgg.head()

     primaryName  tconst  numVotes
0      A.J. Cook       3    156552
1    A.J. Langer       1     26886
2    AJ Michalka       1    311399
3    Aasha Davis       1      5127
4  Abbie Cornish       7   1088936

In [86]:
actressSelectionsAgg = actressSelectionsAgg[actressSelectionsAgg.tconst >= 30]
actressSelectionsAgg.shape

(8, 3)

In [87]:
actressSelectionsAgg.sort_values('numVotes', ascending=False, inplace=True)

# Top 10 Actress Ranked by Highest Movie Rating With 10 or More Films

In [88]:
actressSelectionsAgg.head(10)

            primaryName  tconst  numVotes
444        Cameron Diaz      32   4712966
1437     Julianne Moore      39   4556901
541     Charlize Theron      33   4024444
1428      Julia Roberts      39   3336307
2648     Sandra Bullock      33   3048205
2162  Michelle Pfeiffer      34   2498861
2139       Meryl Streep      36   2449813
2843     Susan Sarandon      36   1402582

In [89]:
directorSelections = castCrewSelections[castCrewSelections.category == 'director']
directorSelections.shape

(4907, 23)

In [90]:
directorSelectionsAgg = (directorSelections.groupby('primaryName')
   .agg({'tconst':'count', 'numVotes': 'sum'})
   .reset_index()
   .rename(columns={'Movies Titles':'Average Rating'})
   )
directorSelectionsAgg.shape

(1651, 3)

In [91]:
directorSelectionsAgg.head()

           primaryName  tconst  numVotes
0         Aaron Blaise       1     81594
1         Aaron Harvey       1     15612
2         Aaron Norris       2     12883
3        Aaron Seltzer       7    390062
4  Abdellatif Kechiche       2    121715

In [92]:
directorSelectionsAgg = directorSelectionsAgg[directorSelectionsAgg.tconst >= 10]
directorSelectionsAgg.shape

(74, 3)

In [93]:
directorSelectionsAgg.sort_values('numVotes', ascending=False, inplace=True)

# Top 10 Directors Ranked by Highest Movie Rating With 10 or More Films

In [94]:
directorSelectionsAgg.head(10)

               primaryName  tconst  numVotes
1471      Steven Spielberg      32  10128214
1253     Quentin Tarantino      12   7797371
1227         Peter Jackson      11   6463701
332          David Fincher      10   6059787
1300          Ridley Scott      23   6041120
1019       Martin Scorsese      26   6008580
1334       Robert Zemeckis      16   4996682
477   Francis Ford Coppola      18   3669139
1520            Tim Burton      15   3520491
1055           Michael Bay      13   3507345

In [95]:
writerSelections = castCrewSelections[castCrewSelections.category == 'writer']
writerSelections.shape

(4227, 23)

In [96]:
writerSelectionsAgg = (writerSelections.groupby('primaryName')
   .agg({'tconst':'count', 'numVotes': 'sum'})
   .reset_index()
   .rename(columns={'Movies Titles':'Average Rating'})
   )
writerSelectionsAgg.shape

(1933, 3)

In [97]:
writerSelectionsAgg.head()

        primaryName  tconst  numVotes
0     A.E. Hotchner       1      6566
1        A.S. Byatt       1     12151
2    Aaron Harberts       1     22140
3    Aaron McGruder       1     30942
4  Aaron Mendelsohn       1     14535

In [98]:
writerSelectionsAgg = writerSelectionsAgg[writerSelectionsAgg.tconst >= 10]
writerSelectionsAgg.shape

(37, 3)

In [99]:
writerSelectionsAgg.sort_values('numVotes', ascending=False, inplace=True)

# Top 10 Writers Ranked by Highest Movie Rating With 10 or More Films

In [100]:
writerSelectionsAgg.head(10)

          primaryName  tconst  numVotes
1687         Stan Lee      20   8598244
448    David S. Goyer      13   6516372
572        Fran Walsh      11   6463701
616      George Lucas      13   5762892
1703     Stephen King      42   5628346
1775     Terry Rossio      18   4822460
1763      Ted Elliott      17   4556464
436       David Koepp      21   4473843
30     Akiva Goldsman      17   3748719
1737  Steven Zaillian      12   3713421